2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_flash_inlilne.h
#ifndef __STM8S_FLASH_INLINE_H
#define __STM8S_FLASH_INLINE_H

#include "private/stm8s_flash_private.h"
#include "stm8s_flash.h"

/* SDCC patch: for >64kB to pass data to/from inline ASM (SDCC doesn't support
 * far pointers yet) */
#if defined(_SDCC_BIGMEM_)
uint32_t asm_addr; // 16b/24b address
uint8_t asm_val;   // 1B data for r/w data
#endif             // _SDCC_BIGMEM_

#if defined(_SDCC_BIGMEM_)
/**
 * @brief  write single byte to address
 * @note   is required for >64kB memory space and SDCC, which doesn't yet
 * support far pointers
 * @param  Address : address to write to
 *         Data :    value to write
 * @retval None
 */
void write_byte_address(uint32_t Address, uint8_t Data) {
  /* store address & data globally for assember */
  asm_addr = Address;
  asm_val = Data;

  /* use inline assembler to write to 16b/24b address */
  __asm__("ld a, _asm_val\n"
          "ldf[_asm_addr + 1].e, a");
}

/**
 * @brief  Reads any byte from flash memory
 * @note   is required for >64kB memory space and SDCC, which doesn't yet
 * support far pointers
 * @param  Address : address to read
 * @retval value read
 */
uint8_t read_byte_address(uint32_t Address) {
  /* store address globally for assember */
  asm_addr = Address;

  /* use inline assembler to read from 16b/24b address */
  __asm__("ldf a, [_asm_addr + 1].e\n"
          "ld _asm_val, a");

  /* return read byte */
  return (asm_val);
}

#endif // _SDCC_BIGMEM_

/**
@code
 This driver provides functions to configure and program the Flash memory of all
 STM8S devices.

 It includes as well functions that can be either executed from RAM or not, and
 other functions that must be executed from RAM otherwise useless.

 The table below lists the functions that can be executed from RAM.

 +--------------------------------------------------------------------------------|
 |   Functions prototypes      |    RAM execution            |     Comments |
 ---------------------------------------------------------------------------------|
 |                             | Mandatory in case of block  | Can be executed |
 | FLASH_WaitForLastOperation  | Operation:                  | from Flash in
case | |                             | - Block programming         | of byte and
word   | |                             | - Block erase               |
Operations         |
 |--------------------------------------------------------------------------------|
 | FLASH_ProgramBlock          |       Exclusively           | useless from
Flash |
 |--------------------------------------------------------------------------------|
 | FLASH_EraseBlock            |       Exclusively           | useless from
Flash |
 |--------------------------------------------------------------------------------|

 To be able to execute functions from RAM several steps have to be followed.
 These steps may differ from one toolchain to another.
 A detailed description is available below within this driver.
 You can also refer to the FLASH examples provided within the
 STM8S_StdPeriph_Lib package.

@endcode
*/

/**
 * @brief  Unlocks the program or data EEPROM memory
 * @param  FLASH_MemType : Memory type to unlock
 *         This parameter can be a value of @ref FLASH_MemType_TypeDef
 * @retval None
 */
inline void FLASH_Unlock_inline(FLASH_MemType_TypeDef FLASH_MemType) {
  /* Check parameter */
  assert_param(IS_MEMORY_TYPE_OK(FLASH_MemType));

  /* Unlock program memory */
  if (FLASH_MemType == FLASH_MEMTYPE_PROG) {
    FLASH->PUKR = FLASH_RASS_KEY1;
    FLASH->PUKR = FLASH_RASS_KEY2;
  }
  /* Unlock data memory */
  else {
    FLASH->DUKR =
        FLASH_RASS_KEY2; /* Warning: keys are reversed on data memory !!! */
    FLASH->DUKR = FLASH_RASS_KEY1;
  }
}

/**
 * @brief  Locks the program or data EEPROM memory
 * @param  FLASH_MemType : Memory type
 *         This parameter can be a value of @ref FLASH_MemType_TypeDef
 * @retval None
 */
inline void FLASH_Lock_inline(FLASH_MemType_TypeDef FLASH_MemType) {
  /* Check parameter */
  assert_param(IS_MEMORY_TYPE_OK(FLASH_MemType));

  /* Lock memory */
  FLASH->IAPSR &= (uint8_t)FLASH_MemType;
}

/**
 * @brief  DeInitializes the FLASH registers to their default reset values.
 * @param  None
 * @retval None
 */
inline void FLASH_DeInit_inline(void) {
  FLASH->CR1 = FLASH_CR1_RESET_VALUE;
  FLASH->CR2 = FLASH_CR2_RESET_VALUE;
  FLASH->NCR2 = FLASH_NCR2_RESET_VALUE;
  FLASH->IAPSR &= (uint8_t)(~FLASH_IAPSR_DUL);
  FLASH->IAPSR &= (uint8_t)(~FLASH_IAPSR_PUL);
  (void)FLASH->IAPSR; /* Reading of this register causes the clearing of status
                         flags */
}

/**
 * @brief  Enables or Disables the Flash interrupt mode
 * @param  NewState : The new state of the flash interrupt mode
 *         This parameter can be a value of @ref FunctionalState enumeration.
 * @retval None
 */
inline void FLASH_ITConfig_inline(FunctionalState NewState) {
  /* Check parameter */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  if (NewState != DISABLE) {
    FLASH->CR1 |= FLASH_CR1_IE; /* Enables the interrupt sources */
  } else {
    FLASH->CR1 &= (uint8_t)(~FLASH_CR1_IE); /* Disables the interrupt sources */
  }
}

/**
 * @brief  Erases one byte in the program or data EEPROM memory
 * @note   PointerAttr define is declared in the stm8s.h file to select if
 *         the pointer will be declared as near (2 bytes) or far (3 bytes).
 * @param  Address : Address of the byte to erase
 * @retval None
 */
inline void FLASH_EraseByte_inline(uint32_t Address) {
  /* Check parameter */
  assert_param(IS_FLASH_ADDRESS_OK(Address));

  /* Erase byte */
  *(PointerAttr uint8_t *)(MemoryAddressCast)Address = FLASH_CLEAR_BYTE;
}

/**
 * @brief  Programs one byte in program or data EEPROM memory
 * @note   PointerAttr define is declared in the stm8s.h file to select if
 *         the pointer will be declared as near (2 bytes) or far (3 bytes).
 * @param  Address : Address where the byte will be programmed
 * @param  Data : Value to be programmed
 * @retval None
 */
inline void FLASH_ProgramByte_inline(uint32_t Address, uint8_t Data) {
  /* Check parameters */
  assert_param(IS_FLASH_ADDRESS_OK(Address));
  *(PointerAttr uint8_t *)(MemoryAddressCast)Address = Data;
}

/**
 * @brief  Reads any byte from flash memory
 * @note   PointerAttr define is declared in the stm8s.h file to select if
 *         the pointer will be declared as near (2 bytes) or far (3 bytes).
 * @param  Address : Address to read
 * @retval Value of the byte
 */
inline uint8_t FLASH_ReadByte_inline(uint32_t Address) {
  /* Check parameter */
  assert_param(IS_FLASH_ADDRESS_OK(Address));

  /* Read byte */
  return (*(PointerAttr uint8_t *)(MemoryAddressCast)Address);
}

/**
 * @brief  Programs one word (4 bytes) in program or data EEPROM memory
 * @note   PointerAttr define is declared in the stm8s.h file to select if
 *         the pointer will be declared as near (2 bytes) or far (3 bytes).
 * @param  Address : The address where the data will be programmed
 * @param  Data : Value to be programmed
 * @retval None
 */
inline void FLASH_ProgramWord_inline(uint32_t Address, uint32_t Data) {
  /* Check parameters */
  assert_param(IS_FLASH_ADDRESS_OK(Address));

