2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_flash_inlilne.h
  /* Enable Word Write Once */
  FLASH->CR2 |= FLASH_CR2_WPRG;
  FLASH->NCR2 &= (uint8_t)(~FLASH_NCR2_NWPRG);

  /* Write one byte - from lowest address*/
  *((PointerAttr uint8_t *)(MemoryAddressCast)Address) = *((uint8_t *)(&Data));
  /* Write one byte*/
  *(((PointerAttr uint8_t *)(MemoryAddressCast)Address) + 1) =
      *((uint8_t *)(&Data) + 1);
  /* Write one byte*/
  *(((PointerAttr uint8_t *)(MemoryAddressCast)Address) + 2) =
      *((uint8_t *)(&Data) + 2);
  /* Write one byte - from higher address*/
  *(((PointerAttr uint8_t *)(MemoryAddressCast)Address) + 3) =
      *((uint8_t *)(&Data) + 3);
}

/**
 * @brief  Programs option byte
 * @param  Address : option byte address to program
 * @param  Data : Value to write
 * @retval None
 */
inline void FLASH_ProgramOptionByte_inline(uint16_t Address, uint8_t Data) {
  /* Check parameter */
  assert_param(IS_OPTION_BYTE_ADDRESS_OK(Address));

  /* Enable write access to option bytes */
  FLASH->CR2 |= FLASH_CR2_OPT;
  FLASH->NCR2 &= (uint8_t)(~FLASH_NCR2_NOPT);

  /* check if the option byte to program is ROP*/
  if (Address == 0x4800) {
    /* Program option byte*/
    *((NEAR uint8_t *)Address) = Data;
  } else {
    /* Program option byte and his complement */
    *((NEAR uint8_t *)Address) = Data;
    *((NEAR uint8_t *)((uint16_t)(Address + 1))) = (uint8_t)(~Data);
  }
  FLASH_WaitForLastOperation(FLASH_MEMTYPE_PROG);

  /* Disable write access to option bytes */
  FLASH->CR2 &= (uint8_t)(~FLASH_CR2_OPT);
  FLASH->NCR2 |= FLASH_NCR2_NOPT;
}

/**
 * @brief  Erases option byte
 * @param  Address : Option byte address to erase
 * @retval None
 */
inline void FLASH_EraseOptionByte_inline(uint16_t Address) {
  /* Check parameter */
  assert_param(IS_OPTION_BYTE_ADDRESS_OK(Address));

  /* Enable write access to option bytes */
  FLASH->CR2 |= FLASH_CR2_OPT;
  FLASH->NCR2 &= (uint8_t)(~FLASH_NCR2_NOPT);

  /* check if the option byte to erase is ROP */
  if (Address == 0x4800) {
    /* Erase option byte */
    *((NEAR uint8_t *)Address) = FLASH_CLEAR_BYTE;
  } else {
    /* Erase option byte and his complement */
    *((NEAR uint8_t *)Address) = FLASH_CLEAR_BYTE;
    *((NEAR uint8_t *)((uint16_t)(Address + (uint16_t)1))) = FLASH_SET_BYTE;
  }
  FLASH_WaitForLastOperation(FLASH_MEMTYPE_PROG);

  /* Disable write access to option bytes */
  FLASH->CR2 &= (uint8_t)(~FLASH_CR2_OPT);
  FLASH->NCR2 |= FLASH_NCR2_NOPT;
}

/**
 * @brief  Reads one option byte
 * @param  Address  option byte address to read.
 * @retval Option byte read value + its complement
 */
inline uint16_t FLASH_ReadOptionByte_inline(uint16_t Address) {
  uint8_t value_optbyte, value_optbyte_complement = 0;
  uint16_t res_value = 0;

  /* Check parameter */
  assert_param(IS_OPTION_BYTE_ADDRESS_OK(Address));

  value_optbyte = *((NEAR uint8_t *)Address); /* Read option byte */
  value_optbyte_complement =
      *(((NEAR uint8_t *)Address) + 1); /* Read option byte complement */

  /* Read-out protection option byte */
  if (Address == 0x4800) {
    res_value = value_optbyte;
  } else {
    if (value_optbyte == (uint8_t)(~value_optbyte_complement)) {
      res_value = (uint16_t)((uint16_t)value_optbyte << 8);
      res_value = res_value | (uint16_t)value_optbyte_complement;
    } else {
      res_value = FLASH_OPTIONBYTE_ERROR;
    }
  }
  return (res_value);
}

/**
 * @brief  Select the Flash behaviour in low power mode
 * @param  FLASH_LPMode Low power mode selection
 *         This parameter can be any of the @ref FLASH_LPMode_TypeDef values.
 * @retval None
 */
inline void FLASH_SetLowPowerMode_inline(FLASH_LPMode_TypeDef FLASH_LPMode) {
  /* Check parameter */
  assert_param(IS_FLASH_LOW_POWER_MODE_OK(FLASH_LPMode));

  /* Clears the two bits */
  FLASH->CR1 &= (uint8_t)(~(FLASH_CR1_HALT | FLASH_CR1_AHALT));

  /* Sets the new mode */
  FLASH->CR1 |= (uint8_t)FLASH_LPMode;
}

/**
 * @brief  Sets the fixed programming time
 * @param  FLASH_ProgTime Indicates the programming time to be fixed
 *         This parameter can be any of the @ref FLASH_ProgramTime_TypeDef
 * values.
 * @retval None
 */
inline void
FLASH_SetProgrammingTime_inline(FLASH_ProgramTime_TypeDef FLASH_ProgTime) {
  /* Check parameter */
  assert_param(IS_FLASH_PROGRAM_TIME_OK(FLASH_ProgTime));

  FLASH->CR1 &= (uint8_t)(~FLASH_CR1_FIX);
  FLASH->CR1 |= (uint8_t)FLASH_ProgTime;
}

/**
 * @brief  Returns the Flash behaviour type in low power mode
 * @param  None
 * @retval FLASH_LPMode_TypeDef Flash behaviour type in low power mode
 */
inline FLASH_LPMode_TypeDef FLASH_GetLowPowerMode_inline(void) {
  return ((FLASH_LPMode_TypeDef)(FLASH->CR1 &
                                 (uint8_t)(FLASH_CR1_HALT | FLASH_CR1_AHALT)));
}

/**
 * @brief  Returns the fixed programming time
 * @param  None
 * @retval FLASH_ProgramTime_TypeDef Fixed programming time value
 */
inline FLASH_ProgramTime_TypeDef FLASH_GetProgrammingTime_inline(void) {
  return ((FLASH_ProgramTime_TypeDef)(FLASH->CR1 & FLASH_CR1_FIX));
}

/**
 * @brief  Returns the Boot memory size in bytes
 * @param  None
 * @retval Boot memory size in bytes
 */
inline uint32_t FLASH_GetBootSize_inline(void) {
  uint32_t temp = 0;

  /* Calculates the number of bytes */
  temp = (uint32_t)((uint32_t)FLASH->FPR * (uint32_t)512);

  /* Correction because size of 127.5 kb doesn't exist */
  if (FLASH->FPR == 0xFF) {
    temp += 512;
  }

  /* Return value */
  return (temp);
}

/**
 * @brief  Checks whether the specified SPI flag is set or not.
 * @param  FLASH_FLAG : Specifies the flag to check.
 *         This parameter can be any of the @ref FLASH_Flag_TypeDef enumeration.
 * @retval FlagStatus : Indicates the state of FLASH_FLAG.
 *         This parameter can be any of the @ref FlagStatus enumeration.
 * @note   This function can clear the EOP, WR_PG_DIS flags in the IAPSR
 * register.
 */
inline FlagStatus FLASH_GetFlagStatus_inline(FLASH_Flag_TypeDef FLASH_FLAG) {
  FlagStatus status = RESET;
  /* Check parameters */
  assert_param(IS_FLASH_FLAGS_OK(FLASH_FLAG));

