2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_flash_inlilne.h
  /* Enable erase block mode */
  FLASH->CR2 |= FLASH_CR2_ERASE;
  FLASH->NCR2 &= (uint8_t)(~FLASH_NCR2_NERASE);

#if defined(STM8S105) || defined(STM8S005) || defined(STM8S103) ||             \
    defined(STM8S003) || defined(STM8S903) || defined(STM8AF626x) ||           \
    defined(STM8AF622x)
  *pwFlash = (uint32_t)0;
#elif defined(STM8S208) || defined(STM8S207) || defined(STM8S007) ||           \
    defined(STM8AF62Ax) || defined(STM8AF52Ax)
  *pwFlash = (uint8_t)0;
  *(pwFlash + 1) = (uint8_t)0;
  *(pwFlash + 2) = (uint8_t)0;
  *(pwFlash + 3) = (uint8_t)0;
#endif
}

/**
 * @brief  Programs a memory block
 * @note   This function should be executed from RAM.
 * @param  FLASH_MemType : The type of memory to program
 * @param  BlockNum : The block number
 * @param  FLASH_ProgMode : The programming mode.
 * @param  Buffer : Pointer to buffer containing source data.
 * @retval None.
 */
IN_RAM(void FLASH_ProgramBlock(uint16_t BlockNum,
                               FLASH_MemType_TypeDef FLASH_MemType,
                               FLASH_ProgramMode_TypeDef FLASH_ProgMode,
                               uint8_t *Buffer)) {
  uint16_t Count = 0;
  uint32_t startaddress = 0;

  /* Check parameters */
  assert_param(IS_MEMORY_TYPE_OK(FLASH_MemType));
  assert_param(IS_FLASH_PROGRAM_MODE_OK(FLASH_ProgMode));
  if (FLASH_MemType == FLASH_MEMTYPE_PROG) {
    assert_param(IS_FLASH_PROG_BLOCK_NUMBER_OK(BlockNum));
    startaddress = FLASH_PROG_START_PHYSICAL_ADDRESS;
  } else {
    assert_param(IS_FLASH_DATA_BLOCK_NUMBER_OK(BlockNum));
    startaddress = FLASH_DATA_START_PHYSICAL_ADDRESS;
  }

  /* Point to the first block address */
  startaddress = startaddress + ((uint32_t)BlockNum * FLASH_BLOCK_SIZE);

  /* Selection of Standard or Fast programming mode */
  if (FLASH_ProgMode == FLASH_PROGRAMMODE_STANDARD) {
    /* Standard programming mode */ /*No need in standard mode */
    FLASH->CR2 |= FLASH_CR2_PRG;
    FLASH->NCR2 &= (uint8_t)(~FLASH_NCR2_NPRG);
  } else {
    /* Fast programming mode */
    FLASH->CR2 |= FLASH_CR2_FPRG;
    FLASH->NCR2 &= (uint8_t)(~FLASH_NCR2_NFPRG);
  }

  /* Copy data bytes from RAM to FLASH memory */
  for (Count = 0; Count < FLASH_BLOCK_SIZE; Count++) {
    *((PointerAttr uint8_t *)(MemoryAddressCast)startaddress + Count) =
        ((uint8_t)(Buffer[Count]));
  }
}

#if defined(_COSMIC_) && defined(RAM_EXECUTION)
/* End of FLASH_CODE section */
#pragma section()
#endif /* _COSMIC_ && RAM_EXECUTION */

#endif
